---
kind: type
id: T:Autodesk.Revit.DB.PointClouds.IPointSetIterator
source: html/fc13e8dc-133b-bb47-a784-d42608a7d8e4.htm
---
# Autodesk.Revit.DB.PointClouds.IPointSetIterator

An interface that Revit will call when iterating through sets of points on the engine.

## Syntax (C#)
```csharp
public interface IPointSetIterator
```

## Remarks
An instance of this interface is obtained from the Point Cloud
 engine when the engine's CreatePointSetIterator method is called.